bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90PWM2B.xml
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF">
                    <bitfield caption="ADC Data Register" mask="0xFFFF" name="ADC"/>
                </register>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
                    <bitfield caption="ADC Auto Trigger Source" mask="0x0F" name="ADTS"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1" mask="0xFF">
                    <bitfield caption="" mask="0x80" name="ADC7D"/>
                    <bitfield caption="" mask="0x40" name="ADC6D"/>
                    <bitfield caption="" mask="0x20" name="ADC5D"/>
                    <bitfield caption="" mask="0x10" name="ADC4D"/>
                    <bitfield caption="" mask="0x08" name="ADC3D"/>
                    <bitfield caption="" mask="0x04" name="ADC2D"/>
                    <bitfield caption="" mask="0x02" name="ADC1D"/>
                    <bitfield caption="" mask="0x01" name="ADC0D"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="" mask="0x20" name="ACMP0D"/>
                    <bitfield caption="" mask="0x10" name="AMP0PD"/>
                    <bitfield caption="" mask="0x08" name="AMP0ND"/>
                    <bitfield caption="" mask="0x04" name="ADC10D"/>
                    <bitfield caption="" mask="0x02" name="ADC9D"/>
                    <bitfield caption="" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="" name="AMP0CSR" offset="0x76" size="1">
                    <bitfield caption="" mask="0x80" name="AMP0EN"/>
                    <bitfield caption="" mask="0x40" name="AMP0IS"/>
                    <bitfield caption="" mask="0x30" name="AMP0G"/>
                    <bitfield caption="" mask="0x03" name="AMP0TS"/>
                </register>
                <register caption="" name="AMP1CSR" offset="0x77" size="1">
                    <bitfield caption="" mask="0x80" name="AMP1EN"/>
                    <bitfield caption="" mask="0x40" name="AMP1IS"/>
                    <bitfield caption="" mask="0x30" name="AMP1G"/>
                    <bitfield caption="" mask="0x03" name="AMP1TS"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART">
                <register caption="USART I/O Data Register" name="UDR" offset="0xC6" size="1" ocd-rw="">
                    <bitfield caption="USART I/O Data" mask="0xFF" name="UDR"/>
                </register>
                <register caption="USART Control and Status register A" name="UCSRA" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data Overrun" mask="0x08" name="DOR"/>
                    <bitfield caption="USART Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double USART Transmission Bit" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
